#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖``
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.gcs_api_extract.random_id.bucket_suffix: Refreshing state... [id=i_k]
module.flyte_gcs_backend.random_id.bucket_suffix: Refreshing state... [id=FsY]
random_password.flyte_db_password: Refreshing state... [id=none]
module.gcs_api_extract.google_storage_bucket.buckets["spotify-web-api-extracts"]: Refreshing state... [id=pricing-aggregator-us-east1-spotify-web-api-extracts]
google_project_service.secret_mgr_api: Refreshing state... [id=exemplary-tide-379122/secretmanager.googleapis.com]
google_project_service.compute_api: Refreshing state... [id=exemplary-tide-379122/compute.googleapis.com]
google_project_iam_custom_role.flyte_backend_role: Refreshing state... [id=projects/exemplary-tide-379122/roles/flyteBackendRole]
google_project_service.container_api: Refreshing state... [id=exemplary-tide-379122/container.googleapis.com]
google_project_service.composer_api: Refreshing state... [id=exemplary-tide-379122/composer.googleapis.com]
google_project_service.cloud_sql_api: Refreshing state... [id=exemplary-tide-379122/sqladmin.googleapis.com]
google_service_account.user_code_service_account: Refreshing state... [id=projects/exemplary-tide-379122/serviceAccounts/user-code-sa@exemplary-tide-379122.iam.gserviceaccount.com]
module.flyte_gcs_backend.google_storage_bucket.buckets["flyte-storage-backend"]: Refreshing state... [id=pricing-aggregator-us-east1-flyte-storage-backend]
google_container_cluster.flyte_cluster: Refreshing state... [id=projects/exemplary-tide-379122/locations/us-east1/clusters/flyte-cluster]
data.google_client_config.default: Reading...
google_service_account.flyte_service_account: Refreshing state... [id=projects/exemplary-tide-379122/serviceAccounts/flyte-sa@exemplary-tide-379122.iam.gserviceaccount.com]
google_project_iam_member.user_code_role_member: Refreshing state... [id=exemplary-tide-379122/roles/editor/serviceAccount:user-code-sa@exemplary-tide-379122.iam.gserviceaccount.com]
module.flyte_gcs_backend.google_storage_bucket_iam_binding.admins["flyte-storage-backend"]: Refreshing state... [id=b/pricing-aggregator-us-east1-flyte-storage-backend/roles/storage.objectAdmin]
data.google_client_config.default: Read complete after 0s [id=projects/"exemplary-tide-379122"/regions/"us-east1"/zones/<null>]
module.gcs_api_extract.google_storage_bucket_iam_binding.admins["spotify-web-api-extracts"]: Refreshing state... [id=b/pricing-aggregator-us-east1-spotify-web-api-extracts/roles/storage.objectAdmin]
google_project_iam_binding.flyte_backend_role_binding: Refreshing state... [id=exemplary-tide-379122/projects/exemplary-tide-379122/roles/flyteBackendRole]
google_sql_database_instance.flyte_db_backend: Refreshing state... [id=flyte-db-backend]
google_container_node_pool.flyte_nodepool: Refreshing state... [id=projects/exemplary-tide-379122/locations/us-east1/clusters/flyte-cluster/nodePools/flyte-node-pool]
google_sql_user.flyte_db_user: Refreshing state... [id=postgres//flyte-db-backend]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_container_cluster.flyte_cluster must be replaced
-/+ resource "google_container_cluster" "flyte_cluster" {
      ~ cluster_ipv4_cidr           = "10.12.0.0/14" -> (known after apply)
      + datapath_provider           = (known after apply)
      ~ default_max_pods_per_node   = 110 -> (known after apply)
      - enable_autopilot            = false -> null
      ~ enable_intranode_visibility = false -> (known after apply)
      - enable_tpu                  = false -> null
      ~ endpoint                    = "35.190.178.167" -> (known after apply)
      ~ id                          = "projects/exemplary-tide-379122/locations/us-east1/clusters/flyte-cluster" -> (known after apply)
      ~ initial_node_count          = 2 -> 1 # forces replacement
      ~ label_fingerprint           = "a9dc16a7" -> (known after apply)
      ~ logging_service             = "logging.googleapis.com/kubernetes" -> (known after apply)
      ~ master_version              = "1.26.5-gke.1200" -> (known after apply)
      ~ monitoring_service          = "monitoring.googleapis.com/kubernetes" -> (known after apply)
        name                        = "flyte-cluster"
      ~ network                     = "projects/exemplary-tide-379122/global/networks/default" -> "default"
      ~ networking_mode             = "VPC_NATIVE" -> (known after apply)
      ~ node_locations              = [
          - "us-east1-b",
          - "us-east1-c",
          - "us-east1-d",
        ] -> (known after apply)
      ~ node_version                = "1.26.5-gke.1200" -> (known after apply)
      + operation                   = (known after apply)
      + private_ipv6_google_access  = (known after apply)
      ~ project                     = "exemplary-tide-379122" -> (known after apply)
      - resource_labels             = {} -> null
      ~ self_link                   = "https://container.googleapis.com/v1/projects/exemplary-tide-379122/locations/us-east1/clusters/flyte-cluster" -> (known after apply)
      ~ services_ipv4_cidr          = "10.16.0.0/20" -> (known after apply)
      ~ subnetwork                  = "projects/exemplary-tide-379122/regions/us-east1/subnetworks/default" -> (known after apply)
      + tpu_ipv4_cidr_block         = (known after apply)
        # (7 unchanged attributes hidden)

      - addons_config {
          - gce_persistent_disk_csi_driver_config {
              - enabled = true -> null
            }
          - network_policy_config {
              - disabled = true -> null
            }
        }

      - binary_authorization {
          - enabled = false -> null
        }

      - cluster_autoscaling {
          - enabled = false -> null
        }

      - database_encryption {
          - state = "DECRYPTED" -> null
        }

      - default_snat_status {
          - disabled = false -> null
        }

      ~ ip_allocation_policy {
          ~ cluster_ipv4_cidr_block       = "10.12.0.0/14" -> (known after apply)
          ~ cluster_secondary_range_name  = "gke-flyte-cluster-pods-3771fe31" -> (known after apply)
          ~ services_ipv4_cidr_block      = "10.16.0.0/20" -> (known after apply)
          ~ services_secondary_range_name = "gke-flyte-cluster-services-3771fe31" -> (known after apply)
            # (1 unchanged attribute hidden)

          - pod_cidr_overprovision_config {
              - disabled = false -> null
            }
        }

      - logging_config {
          - enable_components = [
              - "SYSTEM_COMPONENTS",
              - "WORKLOADS",
            ] -> null
        }

      ~ master_auth {
          + client_certificate     = (known after apply)
          + client_key             = (sensitive value)
          ~ cluster_ca_certificate = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUVMRENDQXBTZ0F3SUJBZ0lRWXRkSXo5dWg3dUhsUHFZUVZjRUw1VEFOQmdrcWhraUc5dzBCQVFzRkFEQXYKTVMwd0t3WURWUVFERXlSa01qUm1NR1EwTmkwek5tSmtMVFJrWkRNdFlXSXlaUzFqTkdFNE1qRXlOMkpsTnpjdwpJQmNOTWpNd056RXhNVFV3TXpFNFdoZ1BNakExTXpBM01ETXhOakF6TVRoYU1DOHhMVEFyQmdOVkJBTVRKR1F5Ck5HWXdaRFEyTFRNMlltUXROR1JrTXkxaFlqSmxMV00wWVRneU1USTNZbVUzTnpDQ0FhSXdEUVlKS29aSWh2Y04KQVFFQkJRQURnZ0dQQURDQ0FZb0NnZ0dCQU5VWm5FT09DNVZMb1d3YXQ4OTRNUEF4cmpmaUtEazdSRXh4TGJtbwpyWFRZcEczTU5GdHRsMHBFMlVoVVdIY01FdzJINGZMQjgvdTFyQXdRdjFsS1g3Qi9oaFNqMm9wNGRPdEQzYWtZCm9GS01NU1hGSFA3UmFkT09MTUY2RkNxaGVkVDJhMVovNDhUclhueWhqWmQ2a3E4VjV4bVlBREM4YnZ5SGRXL2YKanJ4aHBpbVk4a3hlWHZlNVJaYWQ2TnEvUkxqTGZDcFl6eERJUHBYQWlKOXYyNnRWRGFpbHZuWEo2NEtiWGwrZgo2SXhXRFlQbnlSM29BT295UDBBbEhSUnE3dWVDaXBGYWZuaTFJRVNvejI5eGMwc2drUmRnR0FxZENJQyswRC9MClYvWXJnNWkvc0orc0R4Sjd1U0N3U3AyQ3BFUEdUV0UyRTVHeUY3R0FsL3VIbStqSW03aExMei9YYnY0eWtDZHEKNVZBT21ZQVF6aHhHeXpMK2hsQUZrNE1CdUt3KzNjTzN6cXNraVdMUWl6RDdweUp1aUJDQURTREdJNFd6T0Y1egplRy9qOWlkUWdFMW9xTWZlOWE1bUZMSWJ5ZkVlcXBCR2d1WUE4a21BZ2NnNlVhTnFwOTU0bzFXM3NRSjFMd1ZzCkdpNlNIOW01eXFvbWVZdTArVVF1ZkJaVkl3SURBUUFCbzBJd1FEQU9CZ05WSFE4QkFmOEVCQU1DQWdRd0R3WUQKVlIwVEFRSC9CQVV3QXdFQi96QWRCZ05WSFE0RUZnUVUzN0toc3ZlS0RwN0lFTVZ6WUEzN2pjb1lLeFV3RFFZSgpLb1pJaHZjTkFRRUxCUUFEZ2dHQkFCZ3UzWXpQa1l4dGJZWS9GZ0VEc0ZiSnFDdTlBMnlYUG5iQkNjQXFQQTVvCmdDQnJtdndBSGNITVBFN3Y1U3NOTnk5MWxXdThIdkxNWHZPRFd4L2p6Q2FVWFp3UG9LUHBHcENmSGlrd1VDWUcKZUgrM0NlajBhS21hd1VhOXdkTllKVlRBMkxHT3JiT1BodTJBTTJQQk5scDJYMGhPc2c0NExHNk1FN2JZUTh1YQpXamJGdmtDenI4dFowTzJPZ2hkQVNYazc2Vlhkc1BrQmJwbHFJM3lENWR0MlBUYVFzSWtZR0xGNjZ4eldmWnF1Cm5WbThlazdnQnRUMUdRb2Fid1VXYXhFNjU4WUdCZ01Ud3hXSlN6WGcrcVZRbUMwajA3S2Ryb2tmdFB5dkE1cmkKVHB2dGdZZzlWbmdzYUlUdHphelJ6QVZ0YmRKbk1ZWkZTbFFYQ1RQaDc1NXppYkRNU3lvb1dvMFkxS3pEbHFHRwpORy9xSDRyTmU2aW5wYXpTWXVSTFVJZnRxUFdDVWRtTE5MR3JMLzU0VHg3ZnpCbEtwMXlnbWpvdXVmWXMveVhDCmNiWVJraFlyY0xpQnJ5RzBXQVlSSlprc2wvYlhDd1B4SC9XdHdZeDlYRXA0V0hreUVwWGFhaW94MVpUeVZoOUcKOEpabTFWRmJ2SW9pOXdOeHEzcjdEQT09Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K" -> (known after apply)

            # (1 unchanged block hidden)
        }

      - monitoring_config {
          - enable_components = [
              - "SYSTEM_COMPONENTS",
            ] -> null
        }

      - network_policy {
          - enabled  = false -> null
          - provider = "PROVIDER_UNSPECIFIED" -> null
        }

      ~ node_config {
          ~ guest_accelerator = [] -> (known after apply)
          ~ image_type        = "COS_CONTAINERD" -> (known after apply)
          ~ labels            = {} -> (known after apply)
          ~ local_ssd_count   = 0 -> (known after apply)
          ~ machine_type      = "e2-micro" -> (known after apply)
          ~ metadata          = {
              - "disable-legacy-endpoints" = "true"
            } -> (known after apply)
          + min_cpu_platform  = (known after apply)
          ~ oauth_scopes      = [
              - "https://www.googleapis.com/auth/cloud-platform",
            ] -> (known after apply)
          ~ preemptible       = true -> false # forces replacement
          - resource_labels   = {} -> null
          ~ service_account   = "flyte-sa@exemplary-tide-379122.iam.gserviceaccount.com" -> (known after apply)
          - tags              = [] -> null
          ~ taint             = [] -> (known after apply)
            # (4 unchanged attributes hidden)

          - shielded_instance_config {
              - enable_integrity_monitoring = true -> null
              - enable_secure_boot          = false -> null
            }

            # (1 unchanged block hidden)
        }

      - node_pool {
          - initial_node_count          = 2 -> null
          - instance_group_urls         = [
              - "https://www.googleapis.com/compute/v1/projects/exemplary-tide-379122/zones/us-east1-b/instanceGroupManagers/gke-flyte-cluster-flyte-node-pool-3638e593-grp",
              - "https://www.googleapis.com/compute/v1/projects/exemplary-tide-379122/zones/us-east1-d/instanceGroupManagers/gke-flyte-cluster-flyte-node-pool-dd32bdeb-grp",
              - "https://www.googleapis.com/compute/v1/projects/exemplary-tide-379122/zones/us-east1-c/instanceGroupManagers/gke-flyte-cluster-flyte-node-pool-d07916c4-grp",
            ] -> null
          - managed_instance_group_urls = [
              - "https://www.googleapis.com/compute/v1/projects/exemplary-tide-379122/zones/us-east1-b/instanceGroups/gke-flyte-cluster-flyte-node-pool-3638e593-grp",
              - "https://www.googleapis.com/compute/v1/projects/exemplary-tide-379122/zones/us-east1-d/instanceGroups/gke-flyte-cluster-flyte-node-pool-dd32bdeb-grp",
              - "https://www.googleapis.com/compute/v1/projects/exemplary-tide-379122/zones/us-east1-c/instanceGroups/gke-flyte-cluster-flyte-node-pool-d07916c4-grp",
            ] -> null
          - max_pods_per_node           = 110 -> null
          - name                        = "flyte-node-pool" -> null
          - node_count                  = 2 -> null
          - node_locations              = [
              - "us-east1-b",
              - "us-east1-c",
              - "us-east1-d",
            ] -> null
          - version                     = "1.26.5-gke.1200" -> null

          - management {
              - auto_repair  = true -> null
              - auto_upgrade = true -> null
            }

          - network_config {
              - create_pod_range     = false -> null
              - enable_private_nodes = false -> null
              - pod_ipv4_cidr_block  = "10.12.0.0/14" -> null
              - pod_range            = "gke-flyte-cluster-pods-3771fe31" -> null
            }

          - node_config {
              - disk_size_gb      = 10 -> null
              - disk_type         = "pd-balanced" -> null
              - guest_accelerator = [] -> null
              - image_type        = "COS_CONTAINERD" -> null
              - labels            = {} -> null
              - local_ssd_count   = 0 -> null
              - logging_variant   = "DEFAULT" -> null
              - machine_type      = "e2-micro" -> null
              - metadata          = {
                  - "disable-legacy-endpoints" = "true"
                } -> null
              - oauth_scopes      = [
                  - "https://www.googleapis.com/auth/cloud-platform",
                ] -> null
              - preemptible       = true -> null
              - resource_labels   = {} -> null
              - service_account   = "flyte-sa@exemplary-tide-379122.iam.gserviceaccount.com" -> null
              - spot              = false -> null
              - tags              = [] -> null
              - taint             = [] -> null

              - ephemeral_storage_local_ssd_config {
                  - local_ssd_count = 0 -> null
                }

              - shielded_instance_config {
                  - enable_integrity_monitoring = true -> null
                  - enable_secure_boot          = false -> null
                }
            }

          - upgrade_settings {
              - max_surge       = 1 -> null
              - max_unavailable = 0 -> null
              - strategy        = "SURGE" -> null
            }
        }

      - node_pool_defaults {
          - node_config_defaults {
              - logging_variant = "DEFAULT" -> null
            }
        }

      - notification_config {
          - pubsub {
              - enabled = false -> null
            }
        }

      - private_cluster_config {
          - enable_private_endpoint = false -> null
          - enable_private_nodes    = false -> null
          - private_endpoint        = "10.142.0.9" -> null
          - public_endpoint         = "35.190.178.167" -> null

          - master_global_access_config {
              - enabled = false -> null
            }
        }

      - release_channel {
          - channel = "REGULAR" -> null
        }

      - security_posture_config {
          - mode               = "MODE_UNSPECIFIED" -> null
          - vulnerability_mode = "VULNERABILITY_MODE_UNSPECIFIED" -> null
        }

      - service_external_ips_config {
          - enabled = false -> null
        }
    }

  # google_container_node_pool.flyte_nodepool will be updated in-place
  ~ resource "google_container_node_pool" "flyte_nodepool" {
        id                          = "projects/exemplary-tide-379122/locations/us-east1/clusters/flyte-cluster/nodePools/flyte-node-pool"
        name                        = "flyte-node-pool"
      ~ node_count                  = 2 -> 1
        # (9 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @kevinsunny1996, Action: `pull_request`*